{
    "title_reason": "When naming it, I thought about this fragmented era and how to grow within it. The name combines the ideas of 'Rebirth' and 'Vortex', symbolizing being reborn from the fragments.",
    "slogan": "An information management tool for the AI era. Revornix helps you efficiently consolidate all visible information and provides you with a complete report at a specific time.",
    "documentation": "Quick Start",
    "wecom": "WeCom",
    "wecom_tips": "You can join our community group by scanning the QR code below with WeChat.",
    "github_url": "Project GitHub URL",
    "opensource_legal": "Open Source License",
    "blogs": "Blog Updates",
    "company": "Qingyun Technology (Shaoxing) Co., Ltd.",
    "rights": "All rights reserved",
    "features": "Product Features",
    "feature_1": "Cross-platform availability",
    "feature_1_tips": "Currently supports web; iOS app and WeChat Mini Program support coming soon.",
    "feature_2": "All-in-one content aggregation",
    "feature_2_tips": "Centralized content collection, including news, blogs, forums, and more.",
    "feature_3": "Document transformation",
    "feature_3_tips": "Convert files into Markdown using a multimodal large model.",
    "feature_4": "Vectorized storage",
    "feature_4_tips": "We use Milvus, a top-tier industry-leading vector database, to support vector search.",
    "feature_5": "Localization & Open Source",
    "feature_5_tips": "Open-source code with all data stored locally—no concerns about data leakage.",
    "feature_6": "Smart Assistant & Built-in MCP",
    "feature_6_tips": "An AI assistant powered by built-in MCP that can interact with your documents and tools, supporting multi-model switching.",
    "feature_7": "Seamless LLM integration",
    "feature_7_tips": "Built-in model integration support—freely configure and choose the LLM you want (OpenAI-compatible required).",
    "feature_8": "Multilingual & Responsive",
    "feature_8_tips": "Whether you're a Chinese or English user, on mobile or desktop, you'll enjoy a great experience.",
    "tech_stack": "Technology Stack"
}