{
    "published": "Published",
    "developing": "In Development",
    "about": "Expected",
    "stable_run": "Stable Operation",
    "documentation": "Quick Start",
    "wecom": "WeChat Community",
    "wecom_tips": "You can join our WeChat community by scanning the QR code below.",
    "github_url": "Project GitHub Repository",
    "roadmap": "Project Roadmap",
    "opensource_legal": "Open Source License",
    "blogs": "Blog Updates",
    "company": "Qingyon Technology (HangZhou) Co., Ltd.",
    "rights": "All Rights Reserved",
    "latest_news": "Revornix v0.5.0 has been officially released. Welcome to experience and share your feedback.",
    "main_slog": "Collect, Analyze, Summarize, Notify, Share",
    "sub_slog": "Powered by AI — connecting data, analysis, and sharing. Build structured knowledge from massive information so your notes never collect dust again.",
    "dashboard_description": "A brand-new dashboard experience that aggregates more panels.",
    "main_feature_1": "Multi-Channel Collection",
    "main_feature_1_description": "Collect information easily via RSS, web pages, or browser extensions",
    "main_feature_2": "AI-Driven Analysis",
    "main_feature_2_description": "Automatically categorize, summarize, and generate daily highlights",
    "main_feature_3": "Knowledge Sharing",
    "main_feature_3_description": "Share knowledge sections and stay synced with the latest documents",
    "features": "Product Features",
    "features_description": "Focusing on the full chain of collection, analysis, summarization, and sharing, Revornix provides reliable automation at every key stage to help you build a future-ready knowledge operation system.",
    "view_more": "Learn More",
    "feature_1": "Flexible Input Sources",
    "feature_1_tips": "Currently supports RSS, websites, PDFs, Word, Excel, PowerPoint, manual text input, APIs, PIP packages, Node.js packages, and more to come.",
    "feature_2": "Advanced Text Conversion Technology",
    "feature_2_tips": "Built on advanced markdown conversion engines such as MinerU, achieving industry-leading accuracy and allowing for custom conversion engines.",
    "feature_3": "Vector Storage & Knowledge Graph",
    "feature_3_tips": "Powered by personalized GraphRAG and embedding technologies, Revornix converts your inputs into vectorized data and generates a knowledge graph for efficient retrieval and improved model context accuracy.",
    "feature_4": "Integrated Sharing Mechanism",
    "feature_4_tips": "Revornix includes a built-in sharing system — share your knowledge base or access others’ public ones for easy collaboration.",
    "feature_5": "Localization & Open Source",
    "feature_5_tips": "The source code is open, and when deployed locally, all data stays on your own servers — ensuring complete data privacy.",
    "feature_6": "Intelligent Assistant & Built-in MCP",
    "feature_6_tips": "Revornix has a built-in MCP client and server, allowing it to both provide MCP services and call third-party or local MCP functions via the AI assistant.",
    "feature_7": "Seamless Model Integration",
    "feature_7_tips": "Model-agnostic — freely choose which models to use. Each feature can be powered by an independent model.",
    "feature_8": "Multilingual & Responsive",
    "feature_8_tips": "Enjoy a great user experience whether in Chinese or English, on desktop or mobile devices.",
    "system_eco": "Ecosystem Matrix",
    "system_eco_title": "A Multi-Terminal Collaborative Product Ecosystem",
    "system_eco_description": "Revornix spans knowledge ingestion, automated processing, and multi-platform delivery. The component ecosystem continues to expand, building a flexible and robust knowledge network for you.",
    "system_eco_npm": "NPM Package",
    "system_eco_npm_des": "JavaScript package for custom data collection in JS ecosystems",
    "system_eco_pip": "PIP Package",
    "system_eco_pip_des": "Python package for developers in the Python ecosystem",
    "system_eco_chrome_plugin": "Chrome Extension",
    "system_eco_chrome_plugin_des": "Efficient information collection within browser environments",
    "system_eco_ios_app": "iOS App",
    "system_eco_ios_app_des": "Stay in control of your information flow anytime, anywhere",
    "system_eco_wechat_miniprogram": "WeChat Mini Program",
    "system_eco_wechat_miniprogram_des": "Integrate with the WeChat ecosystem for fast sharing and distribution"
}